Repository: Giannisduke/eboy.gr
Catalog: site/web/app/plugins/tbicreditgr/languages/tbicreditgr-*.po
Languages: el

source: Buy now and pay later.
el: Αγοράστε τώρα και πληρώστε αργότερα.

source: Choose whether status you wish after checkout.
el: Επιλέξτε εάν επιθυμείτε την κατάσταση μετά την ολοκλήρωση της αγοράς.

source: Communication problem or You have already sent this order!
el: Πρόβλημα επικοινωνίας ή Έχετε ήδη στείλει αυτήν την παραγγελία!

source: Credit calculator
el: Αριθμομηχανή πίστωσης

source: CREDIT ONLINE INFORMATION WITH TBI BANK
el: ΠΛΗΡΟΦΟΡΙΕΣ ΠΙΣΤΩΣΗΣ ONLINE ΜΕ TBI BANK

source: CREDIT ONLINE INFORMATION WITH TBI BANK!
el: ΠΛΗΡΟΦΟΡΙΕΣ ΠΙΣΤΩΣΗΣ ONLINE ΜΕ TBI BANK!

source: Description
el: Περιγραφή

source: Enable IRIS Pay
el: Ενεργοποιήστε το IRIS Pay

source: Enable tbi bank
el: Ενεργοποίηση tbi bank

source: Enable/Disable
el: Ενεργοποιώ απενεργοποιώ

source: Hide
el: Κρύβω

source: Hide/Show module info
el: Απόκρυψη/Εμφάνιση πληροφοριών μονάδας

source: Hide/Show module info pane on pages.
el: Απόκρυψη/Εμφάνιση παραθύρου πληροφοριών μονάδας στις σελίδες.

source: Instructions
el: Οδηγίες

source: Instructions that will be added to the thank you page and emails.
el: Οδηγίες που θα προστεθούν στη σελίδα ευχαριστιών και στα email.

source: months
el: μήνες

source: Order Status
el: Κατάσταση παραγγελίας

source: Password for eCommerce tbi bank system
el: Κωδικός πρόσβασης για το ηλεκτρονικό εμπόριο tbi bank system

source: Password for eCommerce tbi bank system. Required for system authentication.
el: Κωδικός πρόσβασης για το ηλεκτρονικό εμπόριο tbi bank system. Απαιτείται για έλεγχο ταυτότητας συστήματος.

source: Pay width IRIS Pay
el: Πλάτος πληρωμής IRIS Pay

source: Pay width tbi bank
el: Πλάτος πληρωμής tbi bank

source: Payment method description that the customer will see on your checkout.
el: Περιγραφή του τρόπου πληρωμής που θα δει ο πελάτης στο ταμείο σας.

source: Save changes
el: Αποθήκευσε τις αλλαγές

source: Settings saved successfully.
el: Οι ρυθμίσεις αποθηκεύτηκαν με επιτυχία.

source: Show
el: προβολή

source: Store ID for eCommerce tbi bank system
el: Αναγνωριστικό καταστήματος για σύστημα eCommerce tbi bank

source: Store ID for eCommerce tbi bank system. Required for system authentication.
el: Αναγνωριστικό καταστήματος για σύστημα eCommerce tbi bank. Απαιτείται για έλεγχο ταυτότητας συστήματος.

source: System settings
el: Ρυθμίσεις συστήματος

source: tbi bank (3-60 installments without card & 100% online)
el: tbi bank (3-60 δόσεις χωρίς κάρτα & 100% online)

source: tbi bank - all the module settings
el: tbi bank - όλες οι ρυθμίσεις της μονάδας

source: tbi bank - Module settings
el: tbi bank - Ρυθμίσεις μονάδας

source: tbi bank settings
el: ρυθμίσεις tbi bank

source: tbi bank Status
el: tbi bank κατάσταση

source: This controls the title which the user sees during checkout.
el: Αυτό ελέγχει τον τίτλο που βλέπει ο χρήστης κατά την ολοκλήρωση αγοράς.

source: Title
el: Τίτλος

source: Unique shop identifier
el: Μοναδικό αναγνωριστικό καταστήματος

source: Unique shop identifier in the tbi bank GR system.
el: Μοναδικό αναγνωριστικό καταστήματος στο σύστημα tbi bank GR.

source: Username for eCommerce tbi bank system
el: Όνομα χρήστη για το ηλεκτρονικό εμπόριο tbi bank system

source: Username for eCommerce tbi bank system. Required for system authentication.
el: Όνομα χρήστη για το ηλεκτρονικό εμπόριο tbi bank system. Απαιτείται για έλεγχο ταυτότητας συστήματος.

source: You pay for the merchandise with IRIS Pay
el: Πληρώνετε για τα εμπορεύματα με το IRIS Pay

source: You pay for the merchandise with tbi bank
el: Πληρώνετε για τα εμπορεύματα με την tbi bank
